; domain
(define (domain pacman)

    (:requirements :strips :disjunctive-preconditions :typing :conditional-effects :negative-preconditions)

    (:types
        posicao
    )

    (:predicates
        ; Predicados de Localização
        (pacman-em ?px ?py - posicao)
        (fantasmaB-em ?px ?py - posicao)
        (frutaB-em ?px ?py - posicao)
        (parede-em ?px ?py - posicao)

        ; Predicados de liberação
        (pacman-liberado)
        (fantasmaB-liberado)

        ; Predicados de Direção do Fantasma Azul:
        (fantasmaB-up)
        (fantasmaB-right)
        (fantasmaB-down)
        (fantasmaB-left)

        ; Predicados de Checagem de Morte:
        (checar-morto-pre)
        (checar-morto-pos)

        ; Predicados de Incremento/Decremento:
        (inc ?x ?xn)
        (dec ?x ?xn)

        ; Predicados frutas:
        (frutaB-ativa)

        ; Predicados de finalização
        (fantasmaB-morto)
        (pacman-morto)
    )
    ;----------------------------------------ChecagemPre-----------------------------------------------
    (:action checagem-morto-pre
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pre) (pacman-em ?px ?py))
        :effect (and
            (when
                (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                (pacman-morto)
            )
            (not(checar-morto-pre))
            (fantasmaB-liberado)
            (when
                (and (pacman-em ?px ?py)(frutaB-em ?px ?py))
                (and(frutaB-ativa) (not(frutaB-em ?px ?py))))

        )
    )
    (:action checagem-morto-pos
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pos) (pacman-em ?px ?py))
        :effect (and
            (when
                (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                (pacman-morto)
            )
            (not(checar-morto-pos))
            (pacman-liberado)
        )
    )
    ;----------------------------------------------Pacman-----------------------------------------------------
    (:action move-pacman-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))
                    (pacman-em ?x ?yn)
                    (fantasmaB-down)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?x ?yn)
                    (fantasmaB-up)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaB-right)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaB-left)
                    (checar-morto-pre)
                )
            )
        )
    )
    ;-----------------------------------------------FantasmaBlue------------------------------------------------
    (:action move-fantasmaB-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-up) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?x ?yn)

                    (not(fantasmaB-liberado))
                    (not(fantasmaB-up))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-up)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-down) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?x ?yn)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-down))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-down)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-left) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?xn ?y)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-left))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-left)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaB-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-right) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(fantasmaB-em ?x ?y))
                    (fantasmaB-em ?xn ?y)
                    (not(fantasmaB-liberado))
                    (not(fantasmaB-right))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaB-liberado)) (not(fantasmaB-right)) (checar-morto-pos))
            )
        )
    )
    ;--------------------------------------------ComerBlue-------------------------------------------------------

    (:action comer-fantasma-Blue
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py) (frutaB-ativa))
        :effect (and (fantasmaB-morto) (not(frutaB-ativa)))
    )

)

; problem
(define (problem pacman3x3)
    (:domain pacman)
    (:objects
        x1 x2 x3 x4 x5 y1 y2 y3 y4 y5 - posicao
    )
    (:init
        (pacman-liberado)
        (pacman-em x2 y2)
        (fantasmaB-em x4 y4)
        (frutaB-em x3 y3)

        (parede-em x1 y1)
        (parede-em x1 y2)
        (parede-em x1 y3)
        (parede-em x1 y4)
        (parede-em x1 y5)
        (parede-em x2 y1)
        (parede-em x2 y5)
        (parede-em x3 y1)
        (parede-em x3 y5)
        (parede-em x4 y1)
        (parede-em x4 y5)
        (parede-em x5 y1)
        (parede-em x5 y2)
        (parede-em x5 y3)
        (parede-em x5 y4)
        (parede-em x5 y5)

        (inc x1 x2)
        (inc x2 x3)
        (inc x3 x4)
        (inc x4 x5)
        (inc y1 y2)
        (inc y2 y3)
        (inc y3 y4)
        (inc y4 y5)
        (dec x5 x4)
        (dec x4 x3)
        (dec x3 x2)
        (dec x2 x1)
        (dec y5 y4)
        (dec y4 y3)
        (dec y3 y2)
        (dec y2 y1)

    )
    (:goal
        (and
            (not(pacman-morto))
            (fantasmaB-morto)
        )
    )
)

; plan
1. (move-pacman-down x2 y2 y3)
   deleted: (pacman-em x2 y2) (pacman-liberado)
   added: (pacman-em x2 y3) (fantasmab-up) (checar-morto-pre)
   goals met: 1 of 2
2. (checagem-morto-pre x2 y3)
   deleted: (checar-morto-pre)
   added: (fantasmab-liberado)
   goals met: 1 of 2
3. (move-fantasmab-up x4 y4 y3)
   deleted: (fantasmab-em x4 y4) (fantasmab-liberado) (fantasmab-up)
   added: (fantasmab-em x4 y3) (checar-morto-pos)
   goals met: 1 of 2
4. (checagem-morto-pos x2 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 2
5. (move-pacman-right x2 y3 x3)
   deleted: (pacman-em x2 y3) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmab-left) (checar-morto-pre)
   goals met: 1 of 2
6. (checagem-morto-pre x3 y3)
   deleted: (checar-morto-pre) (frutab-em x3 y3)
   added: (fantasmab-liberado) (frutab-ativa)
   goals met: 1 of 2
7. (move-fantasmab-left x4 y3 x3)
   deleted: (fantasmab-em x4 y3) (fantasmab-liberado) (fantasmab-left)
   added: (fantasmab-em x3 y3) (checar-morto-pos)
   goals met: 1 of 2
8. (comer-fantasma-blue x3 y3)
   deleted: (frutab-ativa)
   added: (fantasmab-morto)
   goals met: 2 of 2
